app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Prisoner of Azkaban"], ["created_at", "2024-02-02 10:18:16.410668"], ["updated_at", "2024-02-02 10:18:16.410668"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "War and Peace"], ["updated_at", "2024-02-02 15:55:23.461719"], ["id", 5]]